<?php

namespace Database\Seeders;

use App\Actions\Install\CompanyContactsSetup;
use App\Actions\Install\CreateAdmin;
use App\Actions\Install\CreateCompany;
use App\Actions\Install\CreateMenu;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    public function run()
    {
        CreateAdmin::make()->handle();
        CreateCompany::make()->handle([
            'name' => [
                'uk' => 'Вічність',
                'ru' => 'Вечность',
            ],
            'description' => [
                'uk' => 'Компанія "Вічність" -це одне з перших похоронних агенств м.Запоріжжя, яке було створено в 1998 році. Десятиліття роботи на ринку ритуальних послуг Запоріжжя, сформували досвід, достатній для вирішення будь-якої задачі. Команда агентів і майстрів може запропонувати рішення на будь-який бюджет - від соціальних варіантів, до ексклюзивних пропозицій. Наше похоронне бюро, крім організації поховання надає весь спектр ритуальних товарів, від вінків до комплекту одягу для покійного. Якщо ви хочете бути впевнені в абсолютно всіх аспектах проведення погребельних заходів, вам слід довіритися нам в організації всіх подій, пов\'язаних з похованням близьких вам людей. Цей варіант для нас більш оптимальний. У цьому випадку все залежить тільки від сил і професійності наших співробітників. Телефонуйте або пишіть нам 24/7, і ми надамо особисту увагу кожному клієнту.',
                'ru' => 'Компания "Вечность" это одно из первых похоронных агентств г.Запорожье, которое было создано в 1998 году. Десятилетия работы на рынке ритуальных услуг Запорожье, сформировали опыт, достаточный для решения любой задачи. Команда агентов и мастеров может предложить решения на любой бюджет - от социальных вариантов, до эксклюзивных предложений. Наше похоронное бюро, кроме организации похорон оказывает весь спектр ритуальных товаров, от венков в комплект одежды для покойного. Если вы хотите быть уверены в абсолютно всех аспектах проведения погребельних мероприятий, вам следует довериться нам в организации всех событий, связанных с погребением близких вам людей. Этот вариант для нас более оптимален. В этом случае все зависит только от сил и профессионализма наших сотрудников. Звоните или пишите нам 24/7, и мы предоставим личное внимание каждому клиенту.',
            ],
        ]);
        CompanyContactsSetup::make()->handle();
        CreateMenu::make()->handle();
    }
}
