<?php

namespace App\Actions\Install;

use App\Models\ProductGroup;
use Lorisleiva\Actions\Concerns\AsAction;

class CreateProducts
{
    use AsAction;

    public function handle()
    {
        foreach ([
                     [
                         'name' => [
                             'uk' => 'Труна лакова',
                             'ru' => 'Гроб лакированый',
                         ],
                         'description' => [
                             'uk' => 'Широкий вибір лакових трун.',
                             'ru' => 'Широкий выбор лакированных гробов.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Труна тканева',
                             'ru' => 'Гроб тканевый',
                         ],
                         'description' => [
                             'uk' => 'Завжди в наявності великий асортимент тканевих трун з шовку, оксамиту, атласу, а також комбіновані.',
                             'ru' => 'Всегда в наличии большой ассортимент тканевых гробов из шёлка, бархата, атласа, а также комбинированные.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Саркофаг',
                             'ru' => 'Саркофаг',
                         ],
                         'description' => [
                             'uk' => 'Для особисто урочистих церемоній пропонуємо лакові саркофаги.',
                             'ru' => 'Для особенных церемрний предлагаем лакированные саркофаги',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Урни для праху',
                             'ru' => 'Урны для праха',
                         ],
                         'description' => [
                             'uk' => 'Урна для праху - це необхідна ємність для процесу кремації. Являє собою посудину, усередині якої знаходиться запаяна капсула з прахом. Урна є обов\'язковою умовою кремації, адже за правилами встановлених санітарних норм, без неї працівники кладовища не мають права поховати прах Вашої близької людини.',
                             'ru' => 'Урна для праха - это необходимая емкость для процесса кремации. Представляет собой сосуд, внутри которого находится запаянная капсула с прахом. Урна является обязательным условием кремации, ведь по правилам установленных санитарных норм, без нее работники кладбища не имеют права похоронить прах Вашего близкого человека.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Вінки з штучних квітів',
                             'ru' => 'Венки из искуственных цветов',
                         ],
                         'description' => [
                             'uk' => 'Вінок - незмінний атрибут похоронного обряду в багатьох культурах, релігіях і країнах. Вінок символізує скорботу втрати, це останній дар живих тим, хто відійшов у кращий світ. Популярні композиції, що мають замкнуте кільце. Вони - символ нескінченності і віри в те, що навіть якщо людини не має в живих, то душа її живе на небесах вічно.',
                             'ru' => 'Венок - неизменный атрибут погребального обряда во многих культурах, религиях и странах. Венок символизирует скорбь утраты, это последний дар живых тем, кто отошел в мир иной. Популярные композиции, имеющие замкнутое кольцо. Они - символ бесконечности и веры в то, что даже если человека не имеет в живых, то душа живет на небесах вечно.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Кошики з штучних квітів',
                             'ru' => 'Крзины с искусственными цветами',
                         ],
                         'description' => [
                             'uk' => 'Кошики з штучних квітів власного виробництва, виготовлення поховальних кошиків на замовлення. У наших салонах великий вибір продукції як у наявності так і під замовлення.',
                             'ru' => 'Корзины из искусственных цветов собственного производства, изготовления погребальных корзин на заказ. В наших салонах большой выбор продукции как в наличии так и под заказ.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Одяг для усопших',
                             'ru' => 'Одежда для усопших',
                         ],
                         'description' => [
                             'uk' => 'За традицією, покійного слід ховати в новому одязі. Наша компанія пропонує широкий вибір чоловічого і жіночого одягу для покійних.',
                             'ru' => 'По традиции, покойного следует прятать в новой одежде. Наша компания предлагает широкий выбор мужской и женской одежды для усопших.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Хрест дерев\'яний на могилу',
                             'ru' => 'Крест деревянный на могилу',
                         ],
                         'description' => [
                             'uk' => 'Ми пропонуємо дерев\'яні хрести на могилу. Наші співробітники встановлять хрест та підготують табличку з ім\'ям покійного.',
                             'ru' => 'Мы предлагаем деревянные кресты на могилу. Наши сотрудники установят крест и подготовят табличку с именем покойного.',
                         ],
                     ],

                 ] as $productGroupData) {
            optional(ProductGroup::query()->firstOrCreate($productGroupData) ?? null, function (ProductGroup $productGroup) {

            });
        }
    }
}
