<?php

namespace App\Actions\Install;

use App\Models\ServiceGroup;
use Lorisleiva\Actions\Concerns\AsAction;

class CreateServices
{
    use AsAction;

    public function handle()
    {
        foreach ([
                     [
                         'name' => [
                             'uk' => 'Організація та проведення поховання',
                             'ru' => 'Организация и проведение захоронения',
                         ],
                         'description' => [
                             'uk' => 'Фахівці нашого ритуального бюро "Вічність" допоможуть у важку хвилину скорботи. Організація і процес похорону пройде з дотриманням усіх побажань замовника. Ритуальна служба "Вічність" надає повний спектр ритуальних послуг: -оформлення всіх документів -підготовка тіла до поховання -транспортування тіла в морг і з моргу -доставка ритуальної атрибутики -оформлення могили для поховання -послуги катафалка -додатковий транспорт (автобус) -організація служби відспівування в храмі, вдома і на кладовищі -медичний супровід похорону -музичний супровід похорону -виготовлення фотографій -послуги розпорядника похорону -організація поминального обіду -одяг і взуття для покійних -широкий вибір ритуальної атрибутики',
                             'ru' => 'Специалисты нашего ритуального бюро "Вечность" помогут в трудную минуту скорби. Организация и процесс похорон пройдет с соблюдением всех пожеланий заказчика. Ритуальная служба "Вечность" предоставляет полный спектр ритуальных услуг: -оформление всех документов -подготовка тела к погребению -Транспортировку тела в морг и из морга -доставка ритуальной атрибутики -оформление могилы для захоронения-услуги катафалка -дополнительный транспорт (автобус) -организация службы отпевания в храме, дома и на кладбище-медицинской сопровождение похорон музыкальный сопровождение похорон -изготовление фотографий-услуги распорядителя похорон -организация поминального обеда -одежда и обувь для усопших -широкий выбор ритуальной атрибутики',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Груз 200',
                             'ru' => 'Груз 200',
                         ],
                         'description' => [
                             'uk' => 'Служба ритуальних послуг «Вічність» надає послуги з перевезення померлого за межі міста і країни, та займається вирішенням усіх питань, пов\'язаних з транспортуванням тіла. Кваліфіковані фахівці нашої компанії підготують потрібну для вивезення померлого документацію, організують спеціальний транспорт, необхідний для перевезення тіла.',
                             'ru' => 'Служба ритуальных услуг «Вечность» предоставляет услуги по перевозке умершего за пределы города и страны, и занимается решением всех вопросов, связанных с транспортировкой тела. Квалифицированные специалисты нашей компании подготовят необходимую для вывоза умершего документацию, организует специальный транспорт, необходимый для перевозки тела.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Кремація',
                             'ru' => 'Кремация',
                         ],
                         'description' => [
                             'uk' => 'Ритуальна служба "Вічність" пропонує також послуги Кремації. Кремація, як спосіб поховання, бере витоки з глибин віків. Такий тип похорону особливо актуальний в мегаполісах з високою щільністю населення. За рахунок кремації скорочується площа кладовищ, зменшується бюджет похорону, але при цьому залишається можливість проводити покійного в останній шлях з дотриманням усіх традицій. Деталі процесу кремації обговорюються особисто при затвердженні плану процесу поховання, з урахуванням всіх побажань замовника.',
                             'ru' => 'Ритуальная служба "Вечность" предлагает услуги Кремации. Кремация, как способ захоронения, берет начало из глубин веков. Такой тип похорон особенно актуален в мегаполисах с высокой плотностью населения. За счет кремации сокращается площадь кладбищ, уменьшается бюджет похорон, но при этом остается возможность проводить покойного в последний путь с соблюдением всех традиций. Детали процесса кремации обсуждаются лично при утверждении плана процесса захоронения, с учетом всех пожеланий заказчика.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'VIP Катафалк',
                             'ru' => 'VIP Катафалк',
                         ],
                         'description' => [
                             'uk' => 'Наша компанія пропонує послуги катафалка CADILLAC Professional Chassis. Внутрішній інтер\'єр катафалка виконаний дизайнерським ательє S&S Coach COMPANY ( USA) VIP-катафалки - традиція гідних проводів покійного в останній шлях. Катафалки даної категорії надають похоронній процесії неймовірну урочистість. Престижний автомобіль підкреслить статус траурної процесії. Також ви можете додатково замовити автобус супроводу для рідних і близьких покійного, бажаючих проводити його в останній шлях. VIP-катафалки виготовлені на базі сучасних автомобілів преміум класу. Комфортабельні автомобілі оснащені системами кондиціонування.',
                             'ru' => 'Наша компания предлагает услуги катафалка CADILLAC Professional Chassis. Внутренний интерьер катафалка выполнен дизайнерским ателье S & S Coach COMPANY (USA) VIP-катафалки - традиция достойных проводов покойного в последний путь. Катафалки данной категории предоставляют похоронной процессии невероятную торжественность. Престижный автомобиль подчеркнет статус траурной процессии. Также вы можете дополнительно заказать автобус сопровождения для родных и близких покойного, желающих проводить его в последний путь. VIP-катафалки изготовлены на базе современных автомобилей премиум класса. Комфортабельные автомобили оснащены системами кондиционирования.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Катафалк',
                             'ru' => 'Катафалк',
                         ],
                         'description' => [
                             'uk' => 'Наша компанія пропонує послуги ритуального автобуса-катафалка Mercedes-Benz Sprinter. Ритуальний автобус - транспортний засіб спеціального призначення, що експлуатується для транспортування труни, пересування учасників траурної церемонії з моргу до місця поховання або кремації, проведення траурних заходів, перевезення супутніх аксесуарів.',
                             'ru' => 'Наша компания предлагает услуги ритуального автобуса-катафалка Mercedes-Benz Sprinter. Ритуальный автобус - транспортное средство специального назначения, эксплуатируется для транспортировки гроба, передвижения участников траурной церемонии из морга к месту захоронения или кремации, проведение траурных мероприятий, перевозки сопутствующих аксессуаров.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Додатковий транспорт',
                             'ru' => 'Дополнительный транспорт',
                         ],
                         'description' => [
                             'uk' => 'Ми надаємо весь необхідний ритуальний транспорт. Автокатафалк для перевезення тіла померлого. Для перевезення похоронної процесії, ми пропонуємо Mercedes-Benz Sprinter на 18 місць.',
                             'ru' => 'Мы предоставляем весь необходимый ритуальный транспорт. Автокатафалк для перевозки тела умершего. Для перевозки похоронной процессии, мы предлагаем Mercedes-Benz Sprinter на 18 мест.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Організатор поховання',
                             'ru' => 'Организатор захоронения',
                         ],
                         'description' => [
                             'uk' => 'В нашій компанії працюють професійні співробітники-розпорядники похорону, які знаходять індивідуальний підхід до кожного учасника прощання і несуть повну відповідальність за організацію похорону.',
                             'ru' => 'В нашей компании работают профессиональные сотрудники-распорядители похорон, которые находят индивидуальный подход к каждому участнику прощание и несут полную ответственность за организацию похорон.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Відспівування',
                             'ru' => 'Отпевание',
                         ],
                         'description' => [
                             'uk' => 'Відспівування покійного - важлива частина ритуалу поховання, проведеного за православними канонами. Служба ритуальних послуг "Вічність" організовує відспівування в храмі, церкві, на дому та кладовищі. Проводить поховання згідно православних, мусульманських, католицьких обрядів.',
                             'ru' => 'Отпевание покойного - важная часть ритуала погребения, проведенного по православным канонам. Служба ритуальных услуг "Вечность" организует отпевание в храме, церкви, на дому и кладбище. Проводит захоронения согласно православным, мусульманским, католических обрядов.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Музичний супровід',
                             'ru' => 'Музыкальное сопровождение',
                         ],
                         'description' => [
                             'uk' => 'Ритуальна служба "Вічність" пропонує до вашої уваги послуги музичного супровіду похоронної процесії ( поховальний оркестр, сольна скрипка, тощо )',
                             'ru' => 'Ритуальная служба "Вечность" предлагает вашему вниманию услуги музыкального сопровождения похоронной процессии (захоронения оркестр, сольная скрипка и т.д.)',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Організація поминального обіду',
                             'ru' => 'Организация поминального обеда',
                         ],
                         'description' => [
                             'uk' => 'Ритуальна служба "Вічність" допоможе вам в організації поминального обіду після похоронної процесії. Ми пропонуємо: -зручне розташування; -наявність окремого банкетного залу або іншого приміщення; -спеціальне меню, відповідне для поминальної трапези після похорону; -ввічливий і уважний сервіс; -можливість вибрати різні банкети за ціною обслуговування.',
                             'ru' => 'Ритуальная служба "Вечность" поможет вам в организации поминального обеда после похоронной процессии. Мы предлагаем: -удобное расположения; -наличие отдельного банкетного зала или другого помещения; -специальных меню, подходящее для поминальной трапезы после похорон; -ввичливий и внимательный сервис; -возможность выбрать различные банкеты по цене обслуживания.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Ритуальна атрибутика',
                             'ru' => 'Ритуальная атрибутика',
                         ],
                         'description' => [
                             'uk' => 'У наших салонах ви зможете підібрати ритуальну атрибутику згідно ваших побажань. Наші консультанти надають відповідь і кваліфіковану допомогу у вирішенні будь-яких питань.',
                             'ru' => 'В наших салонах вы сможете подобрать ритуальную атрибутику согласно вашим пожеланиям. Наши консультанты дают ответ и квалифицированную помощь в решении любых вопросов.',
                         ],
                     ],
                     [
                         'name' => [
                             'uk' => 'Виготовлення та замовлення пам\'ятників',
                             'ru' => 'Изготовление и заказ памятников',
                         ],
                         'description' => [
                             'uk' => 'У наших менеджерів ви можете підібрати та замовити пам`ятники, або меморіальні дошки відповідно своїх побажань. Для більш детальної інформації телефонуйте або замовте зворотній дзвінок.',
                             'ru' => 'У наших менеджеров вы можете подобрать и заказать памятники, или мемориальные доски в соответствии своих пожеланий. Для более подробной информации звоните или закажите обратный звонок.',
                         ],
                     ],
                 ] as $item) {
            optional(ServiceGroup::query()->firstOrCreate($item) ?? null, function (ServiceGroup $serviceGroup) {

            });
        }
    }
}
